In [24]:
people = {
    "first": ['sanjeet','gurjeet','kunu'],
    "last": ['Rai','Singh','Batra'],
    "email": ['raimonu@gmail.com','gurjeet004@gmail.com','kun123@gmail.com']
}

In [25]:
import pandas as pd

In [26]:
df = pd.DataFrame(people)

In [27]:
df

     first   last                 email
0  sanjeet    Rai     raimonu@gmail.com
1  gurjeet  Singh  gurjeet004@gmail.com
2     kunu  Batra      kun123@gmail.com

In [28]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [29]:
df.columns = ['first_name','last_name','email']

In [30]:
df.columns=[x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                 EMAIL
0    sanjeet       Rai     raimonu@gmail.com
1    gurjeet     Singh  gurjeet004@gmail.com
2       kunu     Batra      kun123@gmail.com

In [31]:
#df.columns = df.columns.str.replace('_',' ')

In [32]:
df.rename(columns={'first_name':'first','last_name':'last',},inplace=True)

In [33]:
df

  FIRST_NAME LAST_NAME                 EMAIL
0    sanjeet       Rai     raimonu@gmail.com
1    gurjeet     Singh  gurjeet004@gmail.com
2       kunu     Batra      kun123@gmail.com

In [34]:
df.loc[2]=['Sanjeet','Pandey','pandeysanjeet@gmail.com']

In [35]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0    sanjeet       Rai        raimonu@gmail.com
1    gurjeet     Singh     gurjeet004@gmail.com
2    Sanjeet    Pandey  pandeysanjeet@gmail.com

In [36]:
#df.loc[2, ['LAST NAME','EMAIL']] = ['Rai','raisanjeet8896@gmail.com']

In [37]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0    sanjeet       Rai        raimonu@gmail.com
1    gurjeet     Singh     gurjeet004@gmail.com
2    Sanjeet    Pandey  pandeysanjeet@gmail.com

In [38]:
df.loc[2,'LAST NAME']='Pandey'
df

  FIRST_NAME LAST_NAME                    EMAIL LAST NAME
0    sanjeet       Rai        raimonu@gmail.com       NaN
1    gurjeet     Singh     gurjeet004@gmail.com       NaN
2    Sanjeet    Pandey  pandeysanjeet@gmail.com    Pandey

In [39]:
df.at[2,'LAST NAME']='Rai'
df

  FIRST_NAME LAST_NAME                    EMAIL LAST NAME
0    sanjeet       Rai        raimonu@gmail.com       NaN
1    gurjeet     Singh     gurjeet004@gmail.com       NaN
2    Sanjeet    Pandey  pandeysanjeet@gmail.com       Rai

In [40]:
filt= df['EMAIL']=='raisanjeet8896@gmail.com'
df.loc[filt,'LAST NAME']='Pandey'

In [41]:
df

  FIRST_NAME LAST_NAME                    EMAIL LAST NAME
0    sanjeet       Rai        raimonu@gmail.com       NaN
1    gurjeet     Singh     gurjeet004@gmail.com       NaN
2    Sanjeet    Pandey  pandeysanjeet@gmail.com       Rai

In [42]:
df['EMAIL']=df['EMAIL'].str.upper()
df

  FIRST_NAME LAST_NAME                    EMAIL LAST NAME
0    sanjeet       Rai        RAIMONU@GMAIL.COM       NaN
1    gurjeet     Singh     GURJEET004@GMAIL.COM       NaN
2    Sanjeet    Pandey  PANDEYSANJEET@GMAIL.COM       Rai

In [43]:
#apply
#map
#applymap
#replace

In [44]:
#df['EMAIL'].apply(len)

In [45]:
df['FULL NAME']=df['FIRST_NAME'] + ' ' + df['LAST_NAME']

In [46]:
df

  FIRST_NAME LAST_NAME                    EMAIL LAST NAME       FULL NAME
0    sanjeet       Rai        RAIMONU@GMAIL.COM       NaN     sanjeet Rai
1    gurjeet     Singh     GURJEET004@GMAIL.COM       NaN   gurjeet Singh
2    Sanjeet    Pandey  PANDEYSANJEET@GMAIL.COM       Rai  Sanjeet Pandey